## Plan Result (sbox_backendappgateway)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.backendappgateway.azurerm_application_gateway.ag[0]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.backendappgateway.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw"
    }

  # module.backendappgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw"
        name                              = "cft-aks00-sandbox-agw"
        tags                              = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (7 unchanged attributes hidden)

      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/bulk-scan-orchestrator" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "bulk-scan-orchestrator" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/bulk-scan-payment-processor" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "bulk-scan-payment-processor" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/bulk-scan-processor" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "bulk-scan-processor" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/bulk-scan-sample-app" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "bulk-scan-sample-app" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/dg-docmosis" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "dg-docmosis" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/div-emca" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "div-emca" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/draft-store-service" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "draft-store-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/fpl-case-service" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "fpl-case-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/ia-bail-case-api" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "ia-bail-case-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/ia-case-api" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "ia-case-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/ia-case-documents-api" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "ia-case-documents-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/ia-case-notifications-api" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "ia-case-notifications-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/ia-hearings-api" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "ia-hearings-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/idam-api" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "idam-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/idam-api-sprod" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "idam-api-sprod" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/idam-hmcts-access" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "idam-hmcts-access" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/idam-testing-support-api" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "idam-testing-support-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/idam-user-dashboard" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "idam-user-dashboard" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/idam-user-profile-bridge" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "idam-user-profile-bridge" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/idam-web-admin" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "idam-web-admin" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/idam-web-admin-sprod" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "idam-web-admin-sprod" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/labs-StuartBJustice" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "labs-StuartBJustice" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/labs-darrenbayliss-dev2" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "labs-darrenbayliss-dev2" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/labs-endakelly" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "labs-endakelly" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/labs-hw469" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "labs-hw469" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/labs-jefex7" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "labs-jefex7" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/labs-matthewsearle01-v3" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "labs-matthewsearle01-v3" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/labs-mokainosjavaapp" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "labs-mokainosjavaapp" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/labs-mokainosspringboot" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "labs-mokainosspringboot" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/labs-msl8r" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "labs-msl8r" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/labs-ozzyib" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "labs-ozzyib" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/labs-peterpilgrim-v2" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "labs-peterpilgrim-v2" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/labs-rajivkapoor1" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "labs-rajivkapoor1" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/labs-raraybould" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "labs-raraybould" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/labs-rhodrif" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "labs-rhodrif" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/labs-ssian2" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "labs-ssian2" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/labs-zc-hmcts" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "labs-zc-hmcts" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/payment-api" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "payment-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/plum-frontend" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "plum-frontend" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/probate-business-service" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "probate-business-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/probate-orchestrator-service" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "probate-orchestrator-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/probate-submit-service" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "probate-submit-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/rd-professional-api" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "rd-professional-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/rd-profile-sync" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "rd-profile-sync" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/rd-user-profile-api" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "rd-user-profile-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/reform-scan-blob-router" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "reform-scan-blob-router" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/reform-scan-notification-service" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "reform-scan-notification-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/rpe-send-letter-service" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "rpe-send-letter-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/sscs-evidence-share" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "sscs-evidence-share" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/sscs-tribunals-api" -> null
          - ip_addresses = [
              - "10.2.9.250",
            ] -> null
          - name         = "sscs-tribunals-api" -> null
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "bulk-scan-orchestrator"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "bulk-scan-payment-processor"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "bulk-scan-processor"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "bulk-scan-sample-app"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "dg-docmosis"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "div-emca"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "draft-store-service"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "fpl-case-service"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "ia-bail-case-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "ia-case-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "ia-case-documents-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "ia-case-notifications-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "ia-hearings-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "idam-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "idam-api-sprod"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "idam-hmcts-access"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "idam-testing-support-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "idam-user-dashboard"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "idam-user-profile-bridge"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "idam-web-admin"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "idam-web-admin-sprod"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "labs-StuartBJustice"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "labs-darrenbayliss-dev2"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "labs-endakelly"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "labs-hw469"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "labs-jefex7"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "labs-matthewsearle01-v3"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "labs-mokainosjavaapp"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "labs-mokainosspringboot"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "labs-msl8r"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "labs-ozzyib"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "labs-peterpilgrim-v2"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "labs-rajivkapoor1"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "labs-raraybould"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "labs-rhodrif"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "labs-ssian2"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "labs-zc-hmcts"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "payment-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "plum-frontend"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "probate-business-service"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "probate-orchestrator-service"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "probate-submit-service"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "rd-professional-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "rd-profile-sync"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "rd-user-profile-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "reform-scan-blob-router"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "reform-scan-notification-service"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "rpe-send-letter-service"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "sscs-evidence-share"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "sscs-tribunals-api"
        }

        # (213 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }

        # (5 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1775,"Program":"tfcmt","SHA1":"","Target":"sbox_backendappgateway","Vars":{}} -->